<template>
  <div class="overview">{{ data }}</div>
</template>

<script setup lang="ts">
const data = `
├───📁 assets/
│   ├───📁 css/
│   │   └───...
│   ├───📄 base.css
│   └───📄 main.css
├───📁 components/
│   ├───📁 main-header/
│   │   └───...
│   ├───📁 main-menu/
│   │   └───...
│   ├───📁 page-content/
│   │   └───...
│   ├───📁 page-echarts/
│   │   └───...
│   ├───📁 page-modal/
│   │   └───...
│   └───📁 page-search/
│       └───...
├───📁 global/
│   ├───📄 constants.ts
│   └───📄 register-icons.ts
├───📁 hooks/
│   ├───📄 usePageContent.ts
│   ├───📄 usePageModal.ts
│   └───📄 usePermissions.ts
├───📁 router/
│   ├───📁 main/
│   │   └───...
│   └───📄 index.ts
├───📁 service/
│   ├───📁 config/
│   │   └───...
│   ├───📁 login/
│   │   └───...
│   ├───📁 main/
│   │   └───...
│   ├───📁 request/
│   │   └───...
│   └───📄 index.ts
├───📁 store/
│   ├───📁 login/
│   │   └───...
│   ├───📁 main/
│   │   └───...
│   ├───📄 counter.ts
│   └───📄 index.ts
├───📁 types/
│   ├───📄 index.ts
│   └───📄 login.ts
├───📁 utils/
│   ├───📄 cache.ts
│   ├───📄 format.ts
│   └───📄 map-menus.ts
├───📁 views/
│   ├───📁 login/
│   │   └───...
│   ├───📁 main/
│   │   └───...
│   └───📁 not-found/
│       └───...
├───📄 App.vue
└───📄 main.ts
`
</script>

<style lang="less" scoped>
.overview {
}
</style>
